In [3]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,23],"İzmir":[35,36,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  İzmir
0      30.0    20.0     35
1      29.0     NaN     36
2       NaN    23.0     38

In [6]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  İzmir
0      30.0    20.0     35

In [7]:
havaDurumuDataFrame.dropna(axis=1)

   İzmir
0     35
1     36
2     38

In [8]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,23],"İzmir":[35,36,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   Istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     45.0
1      29.0     NaN     36      NaN
2       NaN    23.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  İzmir
0      30.0    20.0     35
1      29.0     NaN     36
2       NaN    23.0     38

In [11]:
yeniDataFrame

   Istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     45.0
1      29.0     NaN     36      NaN
2       NaN    23.0     38      NaN

In [12]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     45.0
1      29.0    20.0     36     20.0
2      20.0    23.0     38     20.0

In [13]:
maasVerisi = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }

In [14]:
maasDataFrame=pd.DataFrame(maasVerisi)

In [15]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [16]:
grupObjesi=maasDataFrame.groupby("Departman")

In [17]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [18]:
grupObjesi.mean()

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazılım     125

In [19]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## OPERASYONLAR DEVAM..

In [20]:
sozluk1={"Isim":["Huseyin","Nalan","Nazlı","Tolga"],
        "Spor":["Basketbol","Voleybol","Tenis","Futbol"],
        "Kalori":[100,200,400,500]}

In [21]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [22]:
dataFrame1

      Isim       Spor  Kalori
0  Huseyin  Basketbol     100
1    Nalan   Voleybol     200
2    Nazlı      Tenis     400
3    Tolga     Futbol     500

In [23]:
sozluk2={"Isim":["Hasan","Hakan","Ayse","Esra"],
        "Spor":["Basketbol","Hentbol","Tenis","Kosu"],
        "Kalori":[300,350,450,400]}

In [24]:
dataFrame2=pd.DataFrame(sozluk2,index=[0,1,2,3])

In [25]:
dataFrame2

    Isim       Spor  Kalori
0  Hasan  Basketbol     300
1  Hakan    Hentbol     350
2   Ayse      Tenis     450
3   Esra       Kosu     400

In [26]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"], 
           "Spor" : ["Koşu", "Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }

In [27]:
dataFrame3=pd.DataFrame(sozluk3,index=[0,1,2,3])

In [28]:
dataFrame3

     Isim       Spor  Kalori
0    Ayse       Koşu     300
1  Mahmut      Yüzme     400
2   Duygu  Badminton     500
3     Nur      Tenis     250

## Concatenation

In [29]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0  Huseyin  Basketbol     100
1    Nalan   Voleybol     200
2    Nazlı      Tenis     400
3    Tolga     Futbol     500
0    Hasan  Basketbol     300
1    Hakan    Hentbol     350
2     Ayse      Tenis     450
3     Esra       Kosu     400
0     Ayse       Koşu     300
1   Mahmut      Yüzme     400
2    Duygu  Badminton     500
3      Nur      Tenis     250

### Merge

In [30]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu", "Basketbol"]
               }

In [37]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [38]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [33]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,250]
               }

In [34]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [35]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

## Devamı

In [36]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"], 
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }

In [39]:
maasDF=pd.DataFrame(maasSozluk)

In [40]:
maasDF

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [46]:
maasDF["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [47]:
maasDF["Departman"].nunique()

3

In [48]:
maasDF["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [44]:
def bruttenNete(maas):
    return maas * 0.66

In [49]:
maasDF["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [50]:
maasDataFrame.isnull()

   Departman  Calisan Ismi   Maas
0      False         False  False
1      False         False  False
2      False         False  False
3      False         False  False
4      False         False  False
5      False         False  False

In [51]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }

In [52]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [53]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [54]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10